In [35]:
import pandas as pd

data = {'authors': ['Jim, Charles', 'Jim', 'Charlotte', 'Charlotte, Jim'], 'book': ['The Greatest, Book in the World', 'An OK, book', 'A book about books', 'The last book'], 
       'book1': ['4', '3', '2', '1']}

df = pd.DataFrame(data)

In [36]:
df.head()

          authors                             book book1
0    Jim, Charles  The Greatest, Book in the World     4
1             Jim                      An OK, book     3
2       Charlotte               A book about books     2
3  Charlotte, Jim                    The last book     1

In [37]:
# split authors
df.authors = df.authors.str.split(', ')

In [38]:
# explode the column
df = df.explode('authors').reset_index(drop=True)

In [39]:
# display(df)
df

     authors                             book book1
0        Jim  The Greatest, Book in the World     4
1    Charles  The Greatest, Book in the World     4
2        Jim                      An OK, book     3
3  Charlotte               A book about books     2
4  Charlotte                    The last book     1
5        Jim                    The last book     1

In [40]:
df.book = df.book.str.split(', ')

In [41]:
df = df.explode('book').reset_index(drop=True)

In [42]:
df

     authors                book book1
0        Jim        The Greatest     4
1        Jim   Book in the World     4
2    Charles        The Greatest     4
3    Charles   Book in the World     4
4        Jim               An OK     3
5        Jim                book     3
6  Charlotte  A book about books     2
7  Charlotte       The last book     1
8        Jim       The last book     1